## Plan Result (sbox_ai - TerraformPlanApply)




<pre><code>Plan: 1 to add, 9 to change, 0 to destroy.</code></pre>

* Create
  * module.ai.azurerm_private_endpoint.private_endpoint
* Update
  * azurerm_resource_group.rg
  * module.ai.azurerm_ai_foundry.ai_foundry
  * module.ai.azurerm_cognitive_account.cognitive_account
  * module.ai.azurerm_machine_learning_workspace.ml_workspace
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.key_vault.azurerm_key_vault.kv
  * module.storage.azurerm_private_endpoint.this[0]
  * module.storage.azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox"
        name       = "dlrm-ingest-ai-sbox"
      ~ tags       = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-09"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ai.azurerm_ai_foundry.ai_foundry will be updated in-place
  ~ resource "azurerm_ai_foundry" "ai_foundry" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ai-foundry-sbox"
        name                           = "dlrm-ingest-ai-foundry-sbox"
      ~ tags                           = {
          - "__SYSTEM__CognitiveService_dlrmingestcognitiveaccountsbox" = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.CognitiveServices/accounts/dlrm-ingest-cognitive-account-sbox"
          - "application"                                               = "dlrm-data-ingest"
          - "builtFrom"                                                 = "hmcts/dlrm-data-ingest-infra"
          - "businessArea"                                              = "cross-cutting"
          - "criticality"                                               = "Low"
          - "environment"                                               = "sandbox"
          - "expiresAfter"                                              = "2025-04-09"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_cognitive_account.cognitive_account will be updated in-place
  ~ resource "azurerm_cognitive_account" "cognitive_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.CognitiveServices/accounts/dlrm-ingest-cognitive-account-sbox"
        name                               = "dlrm-ingest-cognitive-account-sbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-09"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ai.azurerm_machine_learning_workspace.ml_workspace will be updated in-place
  ~ resource "azurerm_machine_learning_workspace" "ml_workspace" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-sbox"
        name                           = "dlrm-ingest-ml-workspace-sbox"
      ~ tags                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-09"
        } -> (known after apply)
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_private_endpoint.private_endpoint will be created
  + resource "azurerm_private_endpoint" "private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-ai-ml-workspace-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-ai-sbox"
      + subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-aria-migration-sbox"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ml-workspace-psc"
          + private_connection_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-sbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "amlworkspace",
            ]
        }
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Insights/components/dlrm-ingest-ai-appinsights-sbox"
        name                                  = "dlrm-ingest-ai-appinsights-sbox"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-09"
        } -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - dlrm-ingest-ai-appinsights-sbox"
        name                = "Application Insights daily cap reached - dlrm-ingest-ai-appinsights-sbox"
      ~ tags                = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-09"
        } -> (known after apply)
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.key_vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-ai-kv-sbox"
        name                            = "dlrm-ingest-ai-kv-sbox"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-09"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.storage.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrmingestaisasbox"
        name                          = "dlrmingestaisasbox"
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-09"
        } -> (known after apply)
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Storage/storageAccounts/dlrmingestaisasbox"
        name                               = "dlrmingestaisasbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-04-09"
        } -> (known after apply)
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 9 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":82,"Program":"tfcmt","SHA1":"","Target":"sbox_ai - TerraformPlanApply","Vars":{}} -->